//Операторы и выражения C# (справочник по C#) - содержит ифнормацию про разные виды операторов, их условности и методы использования
//Оператор сдвига влево << - опысывает побитовую операцию сдвига и ее последствия
//Буль,_Джордж - статься про ученого в честь которого была названа бинарная алгебра
//Логика - статься описывает логику сложных выражений 
//Логика_высказываний - содержит материалы трансформации логических высказываний и их правила
//Битовая_маска - способ шифровки битов при котором скрываются некоторые биты